MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX564F064H.atdf
   <module caption="" id="00740" name="ICAP" version="1">
      <register-group name="ICAP">
         <register caption="Input Capture 1 Control Register" name="IC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC1CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC1CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC1CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC1CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC1CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC1CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC1CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC1CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC1CON__ON" />
         </register>
         <register caption="Input Capture 1 Control Register" name="IC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC2CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC2CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC2CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC2CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC2CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC2CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC2CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC2CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC2CON__ON" />
         </register>
         <register caption="Input Capture 1 Control Register" name="IC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC3CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC3CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC3CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC3CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC3CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC3CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC3CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC3CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC3CON__ON" />
         </register>
         <register caption="Input Capture 1 Control Register" name="IC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC4CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC4CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC4CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC4CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC4CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC4CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC4CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC4CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC4CON__ON" />
         </register>
         <register caption="Input Capture 1 Control Register" name="IC5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC5CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC5CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC5CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC5CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC5CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC5CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC5CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC5CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC5CON__ON" />
         </register>
         <register caption="" name="IC1BUF" offset="0x10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC1BUF" />
         </register>
         <register caption="" name="IC2BUF" offset="0x210" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC2BUF" />
         </register>
         <register caption="" name="IC3BUF" offset="0x410" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC3BUF" />
         </register>
